/********************************************************************************
 Author : jaytent (jaytent0704@gmail.com)

 Date : October 2018

 File name : AD7171.h

 Description : 该头文件声明了所有AD7171.c文件的函数、宏定义以及类型定义.

 Hardware Platform : STM32F103 + AD7171
********************************************************************************/
#ifndef __AD7171_H
#define __AD7171_H
/**********用户修改内容**********/
#include "IO.h"
#include "IIC.h"
#include "DWT.h"
#include "RTL.h"
#define  AD7171_PDRST     PBout(0)//复位引脚
#define  AD7171_SCLK      IIC_SCL //时钟引脚
#define  AD7171_DOUTRDY   READ_SDA//数据引脚
#define  Delayus          DWT_DelayUs //1us延时函数
#define  Delayms          os_dly_wait //1ms延时函数
#define  VREF             25000    //基准电压,单位0.1ms,注意不要超过供电电压
/********************************/
typedef enum
{
		Normal = 0,  //正常
		OutOfRange,  //超出量程
		IDError,	   //ID不匹配
		TransmitError//传输错误
}ErrorType;//错误类型
/*
*********************************************************************************************************
*	函 数 名: InitAD7171
*	功能说明: 初始化AD7171
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void InitAD7171(void);
/*
*********************************************************************************************************
*	函 数 名: ReadFromAD7171
*	功能说明: 从AD7171读取AD值并转换为电压值
*	形    参：无
*	返 回 值: VINx：输入电压值
*********************************************************************************************************
*/
int ReadFromAD7171(void);
#endif
