/********************************************************************************
 Author : jaytent (jaytent0704@gmail.com)

 Date : October 2018

 File name : MAX14921.h

 Description : 该头文件声明了所有MAX14921.c文件的函数、宏定义以及类型定义.

 Hardware Platform : STM32F103 + MAX14921
********************************************************************************/
#ifndef __MAX14921_H
#define __MAX14921_H
#include "IO.h"
#include "SPI.h"
#include "DWT.h"
#include "RTL.h"

// #define MAX14921_CS           PAout(3)
// #define MAX14921_SAMPL        PAout(4)
#define MAX14921ReadWriteByte SPI1_ReadWriteByte
#define Delayus DWT_DelayUs
#define Delayms os_dly_wait

typedef enum {OFF = 0, ON = !OFF} SwitchState;
/*
*********************************************************************************************************
*	函 数 名: SPI_WR_MAX14921
*	功能说明: MAX14921读写
*	形    参：send_data：SPI配置字
*	返 回 值: receive_data：SPI状态字
*********************************************************************************************************
*/
unsigned int SPI_WR_MAX14921(unsigned int send_data);
/*
*********************************************************************************************************
*	函 数 名: Sampling_And_Hold
*	功能说明: MAX14921采样电容采样并保持
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void Sampling_And_Hold(void);
/*
*********************************************************************************************************
*	函 数 名: AD_CHOOSE_BAT_MAX14921
*	功能说明: MAX14921选择电池进行AD采样
*	形    参：bat_num：电池序号
*	返 回 值: 无
*********************************************************************************************************
*/
void AD_CHOOSE_BAT_MAX14921(unsigned char bat_num);
/*
*********************************************************************************************************
*	函 数 名: Read_Total_VOL
*	功能说明: 读取整组电压
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void Read_Total_VOL(void);
/*
*********************************************************************************************************
*	函 数 名: AD_Choose_Tin
*	功能说明: MAX14921选择T0\1\2三个模拟量进入AOOUT引脚
*	形    参：Tin_num：引脚序号
*	返 回 值: 无
*********************************************************************************************************
*/
void AD_Choose_Tin(unsigned char Tin_num);
/*
*********************************************************************************************************
*	函 数 名: Parasitic_Cap_Calibrate
*	功能说明: 寄生电容误差校准
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void Parasitic_Cap_Calibrate(void);//寄生电容误差校准
/*
*********************************************************************************************************
*	函 数 名: Self_Calibration
*	功能说明: 缓冲器放大失调校准，需要8ms
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void Self_Calibration(void);
/*
*********************************************************************************************************
*	函 数 名: MAX14921CellBalancing
*	功能说明: MAX14921电池均衡
*	形    参：CellNum：电池序号，NewState：开关状态
*	返 回 值: 无
*********************************************************************************************************
*/
void MAX14921CellBalancing(unsigned char CellNum, SwitchState NewState);
/*
*********************************************************************************************************
*	函 数 名: OpenWireDetect
*	功能说明: 开路检测，需要500ms
*	形    参：无
*	返 回 值: ResponseReg：开路检测结果
*********************************************************************************************************
*/
unsigned int OpenWireDetect(void);
#endif
